n = int(input())
dp = [[[0]*2 for _ in range(3)] for _ in range(n)]
#날짜, 연속 결석, 지각

dp[0][0][0] = dp[0][0][1] = dp[0][1][0] = 1

for i in range(1, n):
    dp[i][0][0] = (dp[i-1][0][0] + dp[i-1][1][0] + dp[i-1][2][0]) % 1000000
    dp[i][0][1] = (dp[i-1][0][0] + dp[i-1][0][1] + dp[i-1][1][1] + dp[i-1][1][0] + dp[i-1][2][0] + dp[i-1][2][1])% 1000000
    dp[i][1][0] = dp[i-1][0][0] % 1000000
    dp[i][1][1] = dp[i-1][0][1] % 1000000
    dp[i][2][0] = dp[i-1][1][0] % 1000000
    dp[i][2][1] = dp[i-1][1][1] % 1000000

ans = 0

for i in range(3):
    ans += sum(dp[n-1][i])

ans = ans%1000000

print(ans)